# Homework 4 - Exploring DataFrame
Created by Bharindra Kamanditya

## Import Library

In [1]:
import pandas as pd
import numpy as np

## Soal
Gunakan sheet “Paid-Transaction” dan “Seller” di berkas excel “Homework- DataFrame-Dataset.xlsx” sebagai sumber data untuk diimpor ke DataFrame, lalu jalankan instruksi dan jawablah pertanyaan di bawah ini.

In [2]:
# Read the data from the Excel file
paid_transaction_df = pd.read_excel('Homework-DataFrame-Dataset.xlsx', sheet_name='Paid-Transaction')
seller_df = pd.read_excel('Homework-DataFrame-Dataset.xlsx', sheet_name='Seller')

In [3]:
print(len(paid_transaction_df.columns))
print(paid_transaction_df.columns)
print(len(seller_df.columns))
print(seller_df.columns)

11
Index(['Paid Date', 'Order Number', 'First Name', 'Last Name', 'Meta Category',
       'Product Name', 'Transaction Amount', 'Seller Discount',
       'Sales Discount', 'Delivery Fee', 'Other Discount'],
      dtype='object')
2
Index(['Order Number', 'Seller'], dtype='object')

In [4]:
paid_transaction_df.head()

,Paid Date,Order Number,First Name,Last Name,Meta Category,Product Name,Transaction Amount,Seller Discount,Sales Discount,Delivery Fee,Other Discount
0,20170724,201707240088517,elvride,aries,Babies/ Kids,Pineapple Hat Anak Ala Korea - 6M - 4Y - Unise...,300000,153000,10200.0,9000,0.0
1,20170701,201707018889790,BASIR,Ninuk,Service/ Mokado,Pulsa BOLT 150.000,287800,68000,0.0,0,0.0
2,20170707,201707079264675,Citra,Ardi,Service/ Mokado,"XTRA Combo 12X 6GB, 12bln",35000,0,700.0,0,0.0
3,20170720,201707209945714,Dian,Renaldi,Fashion,Square Foldable Travel Bag / Tas Koper Luggage...,85000,0,5900.0,0,0.0
4,20170722,201707220002354,rizal,Tamba,Gadget/ Komputer,Samsung Galaxy Note 5 Gold,81000,0,5600.0,0,0.0

In [5]:
seller_df.head()

      Order Number        Seller
0  201707209929420  Global Phone
1  201707129550097        E-shop
2  201707039056021   twelven com
3  201707099376522      GRAMEDIA
4  201707028956707        E-Bold

## No. 1
1. Buatlah kolom baru bernama “Full Name” dan sisipkan kolom tersebut setelah kolom “Last Name” yang berisikan nama lengkap dari setiap isian record dengan ketentuan sebagai berikut:

• Nama lengkap menggabungkan “First Name” dan “Last Name”.

• Nama lengkap menggunakan “title case”, yaitu untuk setiap kata, huruf awalnya harus huruf kapital.

In [6]:
paid_transaction_df.insert(
    4,
    'Full Name',
    paid_transaction_df['First Name'].str.capitalize() + ' ' + paid_transaction_df['Last Name'].str.capitalize()
)

In [7]:
print(len(paid_transaction_df.columns))
print(paid_transaction_df.columns)

12
Index(['Paid Date', 'Order Number', 'First Name', 'Last Name', 'Full Name',
       'Meta Category', 'Product Name', 'Transaction Amount',
       'Seller Discount', 'Sales Discount', 'Delivery Fee', 'Other Discount'],
      dtype='object')

In [8]:
paid_transaction_df.head()

,Paid Date,Order Number,First Name,Last Name,Full Name,Meta Category,Product Name,Transaction Amount,Seller Discount,Sales Discount,Delivery Fee,Other Discount
0,20170724,201707240088517,elvride,aries,Elvride Aries,Babies/ Kids,Pineapple Hat Anak Ala Korea - 6M - 4Y - Unise...,300000,153000,10200.0,9000,0.0
1,20170701,201707018889790,BASIR,Ninuk,Basir Ninuk,Service/ Mokado,Pulsa BOLT 150.000,287800,68000,0.0,0,0.0
2,20170707,201707079264675,Citra,Ardi,Citra Ardi,Service/ Mokado,"XTRA Combo 12X 6GB, 12bln",35000,0,700.0,0,0.0
3,20170720,201707209945714,Dian,Renaldi,Dian Renaldi,Fashion,Square Foldable Travel Bag / Tas Koper Luggage...,85000,0,5900.0,0,0.0
4,20170722,201707220002354,rizal,Tamba,Rizal Tamba,Gadget/ Komputer,Samsung Galaxy Note 5 Gold,81000,0,5600.0,0,0.0

## No. 2
2. Tambahkan sebuah kolom setelah kolom “Seller Discount” dan beri nama kolom tersebut sebagai “GMV”. GMV adalah Gross Merchandise Value yang nilainya dihitung berdasarkan “Transaction Amount” dikurangi “Seller Discount” ditambah dengan “Delivery Fee”.

In [9]:
paid_transaction_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12000 entries, 0 to 11999
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Paid Date           12000 non-null  int64
 1   Order Number        12000 non-null  int64
 2   First Name          11996 non-null  object
 3   Last Name           11996 non-null  object
 4   Full Name           11992 non-null  object
 5   Meta Category       12000 non-null  object
 6   Product Name        12000 non-null  object
 7   Transaction Amount  12000 non-null  int64
 8   Seller Discount     12000 non-null  int64
 9   Sales Discount      12000 non-null  float64
 10  Delivery Fee        12000 non-null  int64
 11  Other Discount      12000 non-null  float64
dtypes: float64(2), int64(5), object(5)
memory usage: 1.1+ MB

In [10]:
paid_transaction_df.insert(
    9,
    'GMV', 
    paid_transaction_df['Transaction Amount'] - paid_transaction_df['Seller Discount'] + paid_transaction_df['Delivery Fee']
    )

In [11]:
print(len(paid_transaction_df.columns))
print(paid_transaction_df.columns)

13
Index(['Paid Date', 'Order Number', 'First Name', 'Last Name', 'Full Name',
       'Meta Category', 'Product Name', 'Transaction Amount',
       'Seller Discount', 'GMV', 'Sales Discount', 'Delivery Fee',
       'Other Discount'],
      dtype='object')

In [12]:
paid_transaction_df.head()

,Paid Date,Order Number,First Name,Last Name,Full Name,Meta Category,Product Name,Transaction Amount,Seller Discount,GMV,Sales Discount,Delivery Fee,Other Discount
0,20170724,201707240088517,elvride,aries,Elvride Aries,Babies/ Kids,Pineapple Hat Anak Ala Korea - 6M - 4Y - Unise...,300000,153000,156000,10200.0,9000,0.0
1,20170701,201707018889790,BASIR,Ninuk,Basir Ninuk,Service/ Mokado,Pulsa BOLT 150.000,287800,68000,219800,0.0,0,0.0
2,20170707,201707079264675,Citra,Ardi,Citra Ardi,Service/ Mokado,"XTRA Combo 12X 6GB, 12bln",35000,0,35000,700.0,0,0.0
3,20170720,201707209945714,Dian,Renaldi,Dian Renaldi,Fashion,Square Foldable Travel Bag / Tas Koper Luggage...,85000,0,85000,5900.0,0,0.0
4,20170722,201707220002354,rizal,Tamba,Rizal Tamba,Gadget/ Komputer,Samsung Galaxy Note 5 Gold,81000,0,81000,5600.0,0,0.0

## No. 3

3. Kelompokkan setiap Meta Category menjadi 2 group sesuai tabeldi bawah ini (hint: buat kolom tambahan yang berisi keterangan group 1 atau 2 sesuai Meta Category-nya). Buatlah DataFrame baru yang menyimpan pivot table dari DataFrame “Paid Transaction” di atas untuk menampilkan jumlah total nilai GMV per-bulan untuk setiap group.

> Group 01

> 1. Home/Food 
> 2. Sport/Hobi/Otomotif
> 3. Fashion 
> 4. Beauty/Health

> Group 2

> 1. Gadget/ Komputer 
> 2. Elektronik 
> 3. Service/ Mokado 
> 4. Babies/ Kids

In [13]:
print(paid_transaction_df['Meta Category'].nunique())
print(paid_transaction_df['Meta Category'].unique())

8
['Babies/ Kids' 'Service/ Mokado' 'Fashion' 'Gadget/ Komputer'
 'Beauty/ Health' 'Home/ Food' 'Sports/ Hobi/ Otomotif' 'Elektronik']

In [14]:
def assign_group_no_category(meta_category):
    group_1 = ['Home/ Food', 'Sports/ Hobi/ Otomotif', 'Fashion', 'Beauty/ Health']
    group_2 = ['Elektronik', 'Gadget/ Komputer', 'Service/ Mokado', 'Babies/ Kids']

    if meta_category in group_1:
        return "Group 1"
    elif meta_category in group_2:
        return "Group 2"
    else:
        raise Exception(f"Meta category {meta_category} not found in any group")

In [15]:
paid_transaction_df.insert(
    6,
    'group_no_category',
    paid_transaction_df['Meta Category'].apply(assign_group_no_category)
    )

In [16]:
print(len(paid_transaction_df.columns))
print(paid_transaction_df.columns)

14
Index(['Paid Date', 'Order Number', 'First Name', 'Last Name', 'Full Name',
       'Meta Category', 'group_no_category', 'Product Name',
       'Transaction Amount', 'Seller Discount', 'GMV', 'Sales Discount',
       'Delivery Fee', 'Other Discount'],
      dtype='object')

In [17]:
paid_transaction_df.insert(
    1,
    'year', 
    paid_transaction_df['Paid Date'].apply(str).str[:4]
    )
paid_transaction_df.insert(
    1,
    'month', 
    paid_transaction_df['Paid Date'].apply(str).str[4:6]
    )
paid_transaction_df.insert(
    1,
    'day', 
    paid_transaction_df['Paid Date'].apply(str).str[6:]
    )

In [18]:
print(paid_transaction_df['day'].nunique())
print(paid_transaction_df['day'].unique())
print(paid_transaction_df['month'].nunique())
print(paid_transaction_df['month'].unique())
print(paid_transaction_df['year'].nunique())
print(paid_transaction_df['year'].unique())

31
['24' '01' '07' '20' '22' '14' '03' '29' '06' '28' '08' '18' '21' '09'
 '02' '30' '31' '04' '11' '12' '17' '13' '25' '15' '05' '16' '23' '27'
 '26' '19' '10']
6
['07' '08' '09' '10' '11' '12']
1
['2017']

In [19]:
paid_transaction_df.head()

,Paid Date,day,month,year,Order Number,First Name,Last Name,Full Name,Meta Category,group_no_category,Product Name,Transaction Amount,Seller Discount,GMV,Sales Discount,Delivery Fee,Other Discount
0,20170724,24,07,2017,201707240088517,elvride,aries,Elvride Aries,Babies/ Kids,Group 2,Pineapple Hat Anak Ala Korea - 6M - 4Y - Unise...,300000,153000,156000,10200.0,9000,0.0
1,20170701,01,07,2017,201707018889790,BASIR,Ninuk,Basir Ninuk,Service/ Mokado,Group 2,Pulsa BOLT 150.000,287800,68000,219800,0.0,0,0.0
2,20170707,07,07,2017,201707079264675,Citra,Ardi,Citra Ardi,Service/ Mokado,Group 2,"XTRA Combo 12X 6GB, 12bln",35000,0,35000,700.0,0,0.0
3,20170720,20,07,2017,201707209945714,Dian,Renaldi,Dian Renaldi,Fashion,Group 1,Square Foldable Travel Bag / Tas Koper Luggage...,85000,0,85000,5900.0,0,0.0
4,20170722,22,07,2017,201707220002354,rizal,Tamba,Rizal Tamba,Gadget/ Komputer,Group 2,Samsung Galaxy Note 5 Gold,81000,0,81000,5600.0,0,0.0

In [20]:
pivot_table_df = pd.pivot_table(paid_transaction_df, values='GMV', index=['month', 'group_no_category'], columns=['year'], aggfunc="sum")

In [21]:
pivot_table_df

year                          2017
month group_no_category
07    Group 1            147724300
      Group 2            230414100
08    Group 1             94599100
      Group 2            348790700
09    Group 1            263786400
      Group 2            191482700
10    Group 1            114883100
      Group 2            150263700
11    Group 1            263329200
      Group 2            326532200
12    Group 1            131366800
      Group 2            451421300

## No. 4
Buatlah python statement untuk mencari Seller mana yang memiliki total nilai GMV paling tinggi di bulan Agustus 2017. (Hint: gunakan juga sheet “Seller”)

In [22]:
paid_transaction_df_copy = paid_transaction_df.copy()

In [23]:
paid_transaction_df_copy = paid_transaction_df_copy.join(seller_df.set_index('Order Number'), on='Order Number', validate='m:1')

In [24]:
paid_transaction_df_copy = paid_transaction_df_copy[paid_transaction_df_copy['month'] == '08']

In [25]:
paid_transaction_df_copy = paid_transaction_df_copy.filter(['GMV', 'Seller'])

In [26]:
paid_transaction_df_copy.groupby(by=["Seller"]).sum().sort_values(by='GMV', ascending=False).head(1)

                       GMV
Seller
MOBILEPULSA APP  127241500

## No. 5
Buatlah python statement untuk mencari Seller mana yang memiliki banyaknya transaksi (count) paling banyak di bulan September 2017 khusus untuk Meta Category “Fashion”. (Hint: gunakan juga sheet “Seller”)

In [77]:
paid_transaction_df_copy = paid_transaction_df.copy()

In [78]:
paid_transaction_df_copy = paid_transaction_df_copy.join(seller_df.set_index('Order Number'), on='Order Number', validate='m:1')

In [79]:
paid_transaction_df_copy = paid_transaction_df_copy[paid_transaction_df_copy['month'] == '09']
paid_transaction_df_copy = paid_transaction_df_copy[paid_transaction_df_copy['Meta Category'] == 'Fashion']

In [80]:
paid_transaction_df_copy = paid_transaction_df_copy.filter(['Order Number', 'Seller']).rename(columns={"Seller": "Seller", "Order Number": "Total Transaction"})

In [82]:
paid_transaction_df_copy.groupby(by=["Seller"]).count().sort_values(by='Total Transaction', ascending=False).head(1)

           Total Transaction
Seller
tokoaqila                 31